In [47]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.510714 -0.211566
1    a  two -0.985862  1.155822
2    b  one  0.511721  0.184145
3    b  two  0.559615 -0.467447
4    a  one -1.108765  0.353169

In [4]:
df.groupby('key1')['data1'].mean()

key1
a   -0.868447
b    0.535668
Name: data1, dtype: float64

In [5]:
df.groupby('key2')['data1'].mean()

key2
one   -0.369253
two   -0.213124
Name: data1, dtype: float64

In [10]:
type(df['data1'])

pandas.core.series.Series

In [9]:
type(df[['data1']])

pandas.core.frame.DataFrame

In [12]:
np.random.seed(0)
np.random.uniform(50,100,10).astype(np.int)

array([77, 85, 80, 77, 71, 82, 71, 94, 98, 69])

In [15]:
df1=pd.DataFrame(_.reshape(5, 2), columns = ['examl1','exam2'])
df1

   examl1  exam2
0      77     85
1      80     77
2      71     82
3      71     94
4      98     69

In [17]:
df2 = pd.DataFrame(['a','b','a','b','ab'], columns = ['blood_type'])
df2

  blood_type
0          a
1          b
2          a
3          b
4         ab

In [19]:
df3 = pd.concat((df1, df2), axis = 1)
df3

   examl1  exam2 blood_type
0      77     85          a
1      80     77          b
2      71     82          a
3      71     94          b
4      98     69         ab

In [20]:
df3.groupby('blood_type').apply(np.mean)

            examl1  exam2
blood_type
a             74.0   83.5
ab            98.0   69.0
b             75.5   85.5

In [21]:
df3.groupby('blood_type').mean()

            examl1  exam2
blood_type
a             74.0   83.5
ab            98.0   69.0
b             75.5   85.5

In [23]:
def custom_mean(data_frame):
 return data_frame.mean(axis=0)
df3.groupby('blood_type').apply(custom_mean)

            examl1  exam2
blood_type
a             74.0   83.5
ab            98.0   69.0
b             75.5   85.5

In [24]:
df3.describe().round(1)

       examl1  exam2
count     5.0    5.0
mean     79.4   81.4
std      11.1    9.3
min      71.0   69.0
25%      71.0   77.0
50%      77.0   82.0
75%      80.0   85.0
max      98.0   94.0

In [25]:
df4 = pd.concat((df3, pd.DataFrame(['m','f','m','f','m'], columns = ['gender'])), axis = 1)

In [26]:
df4

   examl1  exam2 blood_type gender
0      77     85          a      m
1      80     77          b      f
2      71     82          a      m
3      71     94          b      f
4      98     69         ab      m

In [27]:
df4.groupby(['blood_type','gender']).apply(custom_mean)

# 컨딘젼시 테이블

                   examl1  exam2
blood_type gender
a          m         74.0   83.5
ab         m         98.0   69.0
b          f         75.5   85.5

In [28]:
df4.groupby(['gender']).apply(custom_mean)  # 범주형 변수는 빼고 계산함.

        examl1      exam2
gender
f         75.5  85.500000
m         82.0  78.666667

In [29]:
df4.groupby(['blood_type', 'gender']).apply(np.mean)

                   examl1  exam2
blood_type gender
a          m         74.0   83.5
ab         m         98.0   69.0
b          f         75.5   85.5

In [30]:
_.index

MultiIndex(levels=[['a', 'ab', 'b'], ['f', 'm']],
           codes=[[0, 1, 2], [1, 1, 0]],
           names=['blood_type', 'gender'])

In [32]:
df4.groupby(['blood_type', 'gender']).apply(np.mean)

                   examl1  exam2
blood_type gender
a          m         74.0   83.5
ab         m         98.0   69.0
b          f         75.5   85.5

In [35]:
# multi_index된 최종 결과물을 tidy한 format으로 바꾸고 싶다면

df4.groupby(['blood_type', 'gender']).apply(np.mean).reset_index()
# 분석하기 위한 형태로 바꾸기 위해 인덱스가 비어있거나, 새로운 인덱스를 채워주기

  blood_type gender  examl1  exam2
0          a      m    74.0   83.5
1         ab      m    98.0   69.0
2          b      f    75.5   85.5

In [45]:
df3 = pd.concat((df1, df2), axis=1)

In [46]:
# 숫자형 변수 대상

pd.cut(df3.exam1, 2)

AttributeError: 'DataFrame' object has no attribute 'exam1'

In [43]:
pd.qcut(df3.exam1, 2)  # 두조각으로

AttributeError: 'DataFrame' object has no attribute 'exam1'

Pivot table

In [48]:
url="https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/tips.csv"
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [49]:
tips.pivot_table(index =['sex','smoker'])

                   size       tip  total_bill
sex    smoker
Female No      2.592593  2.773519   18.105185
       Yes     2.242424  2.931515   17.977879
Male   No      2.711340  3.113402   19.791237
       Yes     2.500000  3.051167   22.284500

In [50]:
tips.pivot_table(['total_bill', 'size'], index=['sex', 'day'], columns='smoker').round(1)

            size      total_bill
smoker        No  Yes         No   Yes
sex    day
Female Fri   2.5  2.0       19.4  12.7
       Sat   2.3  2.2       19.0  20.3
       Sun   3.1  2.5       20.8  16.5
       Thur  2.5  2.4       16.0  19.2
Male   Fri   2.0  2.1       17.5  20.5
       Sat   2.7  2.6       19.9  21.8
       Sun   2.9  2.6       20.4  26.1
       Thur  2.5  2.3       18.5  19.2

In [51]:
tips['smoker'].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [55]:
tips.pivot_table(['total_bill', 'size'], index=['sex', 'day'], columns='smoker', margins=True).round(1)

            size           total_bill
smoker        No  Yes  All         No   Yes   All
sex    day
Female Fri   2.5  2.0  2.1       19.4  12.7  14.1
       Sat   2.3  2.2  2.2       19.0  20.3  19.7
       Sun   3.1  2.5  2.9       20.8  16.5  19.9
       Thur  2.5  2.4  2.5       16.0  19.2  16.7
Male   Fri   2.0  2.1  2.1       17.5  20.5  19.9
       Sat   2.7  2.6  2.6       19.9  21.8  20.8
       Sun   2.9  2.6  2.8       20.4  26.1  21.9
       Thur  2.5  2.3  2.4       18.5  19.2  18.7
All          2.7  2.4  2.6       19.2  20.8  19.8